Revit 2027 API
ParameterTypeId.ClassificationDescription Property
 "Classification Title"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ClassificationDescription { get; }
Public Shared ReadOnly Property ClassificationDescription As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ClassificationDescription {
	ForgeTypeId^ get ();
}
static member ClassificationDescription : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace